app/controllers/comments_controller.rb

  def edit
    if Story.find(params[:story_id]).disable_commenting
---
SELECT * FROM "comments" WHERE ("comments"."id" = 7)
SELECT * FROM "stories" WHERE ("stories"."id" = 20)

  def create
    unless Story.find(params[:story_id]).disable_commenting
      @comment.user_id = current_user.id
      @comment.story_id = params[:story_id]
      @comment.score = 0

      # Akismet hook
      if !@comment.spam? : @comment.is_approved = true else @comment.is_approved = false end

      @comment.save
---
SELECT * FROM "stories" WHERE ("stories"."id" = 20)
INSERT INTO "comments" ("score", "updated_at", "body", "story_id", "user_id", "created_at") VALUES(0.0, '2009-12-07 23:18:41', 'test', 20, 1, '2009-12-07 23:18:41')

  def update
    unless Story.find(params[:story_id]).disable_commenting
      if @comment.update_attributes(params[:comment])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 7)
SELECT * FROM "stories" WHERE ("stories"."id" = 20)
UPDATE "comments" SET "body" = 'gay comment22', "updated_at" = '2009-12-07 23:39:59' WHERE "id" = 7

  def destroy
    @comment.destroy
---
DELETE FROM "comments" WHERE "id" = 10