app/controllers/comments_controller.rb

  def destroy
    @comment = Comment.find(params[:id])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 10)