app/controllers/stories_controller.rb

  def index

    # sorting
    if params[:order]
      # get time
      if params[:time] == "today"
        time = (Time.now - 1.day).utc
      elsif params[:time] == "week"
        time = (Time.now - 7.days).utc
      elsif params[:time] == "month"
        time = (Time.now - 1.month).utc
      else
        # TODO: Generate a date from 01-01-2009
        time = Time.utc(2009, 01, 01)
      end
      # ci score sorting
      if params[:order] == "best"
        # Order by Score
        # Descending
        if params[:sort] == "desc"
          @stories = Story.paginate(:page => params[:page],
          :order => 'score DESC', :conditions => ["created_at >= ?", time])
---
SELECT * FROM "stories" WHERE (created_at >= '2009-01-01 00:00:00') ORDER BY created_at DESC LIMIT 20 OFFSET 0
SELECT count(*) AS count_all FROM "stories" WHERE (updated_at >= '2009-01-01 00:00:00')

  def show
    # get chapter
    if params[:chapter_number]
      @chapter = @story.chapters.find_by_chapter_number(params[:chapter_number])
      @page = @chapter.pages.first(:order => 'page_number ASC')
    elsif params[:page_number]
      @page = @story.pages.find_by_page_number(params[:page_number])
      @chapter = @page.chapter
    else
      @chapter = @story.chapters.first(:order => 'chapter_number ASC')
      @page = @chapter.pages.first(:order => 'page_number ASC') if @chapter
    end
    # get next and previous page
    if @page
      @previous_page = @story.pages.find_by_page_number(@page.page_number - 1)
      @next_page = @story.pages.find_by_page_number(@page.page_number + 1)
      @page_content = RedCloth.new(@page.body, [:filter_styles, :filter_classes, :filter_ids]).to_html
    end
    unless @story.disable_commenting
      @comment = Comment.new
      @comments = @story.comments.find(:all, :order => "score desc")
---
SELECT * FROM "comments" WHERE ("comments".story_id = 20)

  def create
    @story.user_id = current_user.id
    @story.score = 0

    respond_to do |format|
      # easily enable recaptcha
      #if verify_recaptcha(@story) && @story.save
      if @story.save
---
INSERT INTO "stories" ("score", "updated_at", "body", "title", "user_id", "created_at") VALUES(0.0, '2009-11-30 04:55:42', 'test', 'test', 13, '2009-11-30 04:55:42')

  def update
    respond_to do |format|
      if @story.update_attributes(params[:story])
---
UPDATE "stories" SET "body" = 'az2', "updated_at" = '2009-11-22 03:56:58' WHERE "id" = 5

  def destroy
    @story.votes.destroy_all
---
DELETE FROM "stories" WHERE "id" = 1
DELETE FROM "votes" WHERE "id" = 1

  def vote
    unless @story.disable_voting
      unless current_user.id == @story.user.id
        if params[:vote].to_i == 1 then
          current_user.vote_for(@story)
        else
          current_user.vote_against(@story)
        end
        # update ci score here
        @story.score = ci_lower_bound(@story.votes_for, @story.votes_count, 0.10)
        @story.save!
---
INSERT INTO "votes" ("voteable_id", "voter_id", "updated_at", "vote", "voter_type", "voteable_type", "created_at") VALUES(7, 13, '2009-11-24 07:25:49', 'f', 'User', 'Story', '2009-11-24 07:25:49')
UPDATE "stories" SET "score" = 0.269865944074627, "updated_at" = '2009-11-24 22:43:50' WHERE "id" = 8