app/controllers/stories_controller.rb

SELECT * FROM "stories" WHERE ("stories"."id" = 0)
---
  def show
    @story = Story.find(params[:id])

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
---
  def edit
    @story = Story.find(params[:id])

SELECT * FROM "stories" WHERE ("stories"."id" = 5)
---
  def update
    @story = Story.find(params[:id])

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
---
  def destroy
    @story = Story.find(params[:id])

SELECT * FROM "stories" WHERE ("stories"."id" = 7)
SELECT * FROM "users" WHERE ("users"."id" = 13) LIMIT 1
---
  def vote
    @story = Story.find(params[:id])
    @user = User.find(session[:user_id])