app/controllers/users_controller.rb

  def index
    # unless User.find(session[:user_id]).is_admin?
    #   redirect_to :controller => 'stories', :action => 'index'
    # end
    @users = User.find(:all, :order => :name)
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def create
    @user = User.new(params[:user])


    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("updated_at", "crypted_password", "username", "password_salt", "persistence_token", "rpx_identifier", "email", "created_at") VALUES('2009-12-03 22:40:22', 'fa2b0cedcfc9979892523b9e7b70a5c72a87811e37df430b1f97b485c95cab752fce41899f4c0256c9002ebbc911fbbb2dbb37a9cd14f254b32ae235ae676387', 'testy', 'ATm9tbr8zJagMBueeHAS', '1124615f0b69d410025122e614578fc73916171a5453e37138f26fb29977d904aa9e78d0682d313347aef958ef2bfe3c69915c1f2b8d0a21b6a7c34e2fba3277', NULL, 'novalidationyay@com.com', '2009-12-03 22:40:22')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 9) LIMIT 1
UPDATE "users" SET "hashed_password" = '7f9c788d3ffac387fdaf6a9f95763b1d9858eec9', "updated_at" = '2009-11-20 02:27:25', "is_admin" = 't', "salt" = '598387300.82019332123489' WHERE "id" = 13

  def destroy
    @user = User.find(params[:id])
    # destroy all stories!
    @user.stories.destroy_all
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
DELETE FROM "stories" WHERE "id" = 5
DELETE FROM "users" WHERE "id" = 1

  def forgot_password
    user = User.find_by_email(params[:email])
    if (user)
      user.reset_password_code_until = 1.day.from_now
      user.reset_password_code =  Digest::SHA1.hexdigest( "#{user.email}#{Time.now.to_s.split(//).sort_by {rand}.join}" )
      user.save!
---
SELECT "users".id FROM "users" WHERE ("users"."email" = 'jsilverman2@gmail.com' AND "users".id <> 13) LIMIT 1
UPDATE "users" SET "reset_password_code" = 'c4f7914e1127892a7008912b55a7bffa2a551d44', "reset_password_code_until" = '2009-11-24 06:20:34', "updated_at" = '2009-11-23 06:20:35' WHERE "id" = 13

  def activate
    user = User.find_by_activation_code(params[:activation_code])
    user.is_activated = true
    user.save!
---
SELECT * FROM "users" WHERE ("users"."activation_code" = 'eea0fbc5b96c4911d8a6c0bbf3a6674c86a37561') LIMIT 1
UPDATE "users" SET "is_activated" = 't', "updated_at" = '2009-11-24 09:07:18' WHERE "id" = 19