app/controllers/user_sessions_controller.rb

INSERT INTO "users" ("updated_at", "crypted_password", "username", "password_salt", "persistence_token", "rpx_identifier", "email", "created_at") VALUES('2009-12-04 02:33:52', NULL, 'jsilverman2', NULL, '150c60f89aa4d66b975c60d8ae29fe18cee63fe506603eadc3196c512917a9ef4a4266f09eb40701cc7474608b9ab7c451e4311eefe28d3823d77c44ed7f658f', 'https://www.google.com/accounts/o8/id?id=AItOawljZGYCMuzO1dwVIEmeQdA5KVMtRbIF4qY', 'jsilverman2@gmail.com', '2009-12-04 02:33:52')
---
	def create
		@user_session = UserSession.new(params[:user_session])
		if @user_session.save